In [1]:
import pandas as pd #read,process,analysis #2-D DS

In [2]:
exam_data = {
    "name" : ["a", "b", "c", "d", "e", "f"],
    "scores" : [1,2,3,4,5,6],
    "attempts" : [1,2,3,4,5,6],
}
labels = ["1.","2.","3.","4.","5.","6."]
df = pd.DataFrame(exam_data , index=labels)
df

   name  scores  attempts
1.    a       1         1
2.    b       2         2
3.    c       3         3
4.    d       4         4
5.    e       5         5
6.    f       6         6

In [3]:
df.head(4)

   name  scores  attempts
1.    a       1         1
2.    b       2         2
3.    c       3         3
4.    d       4         4

In [4]:
df.iloc[1:4]

   name  scores  attempts
2.    b       2         2
3.    c       3         3
4.    d       4         4

In [5]:
df['scores']

1.    1
2.    2
3.    3
4.    4
5.    5
6.    6
Name: scores, dtype: int64

In [6]:
df[df["name"] == "a"]

   name  scores  attempts
1.    a       1         1

In [7]:
df[df["name"] == "a"]["scores"]

1.    1
Name: scores, dtype: int64

In [8]:
df.loc['5.', 'scores'] = 10
df

   name  scores  attempts
1.    a       1         1
2.    b       2         2
3.    c       3         3
4.    d       4         4
5.    e      10         5
6.    f       6         6

In [9]:
df[(df['scores'] >= 3) & (df["scores"] <= 10)]

   name  scores  attempts
3.    c       3         3
4.    d       4         4
5.    e      10         5
6.    f       6         6

In [10]:
df["attempts"].sum()

21

In [11]:
df['scores'].mean()

4.333333333333333